# ArcCos

## Description
Function ArcCos returns the arccosine (in radians) of the specified value.

```pascal
FUNCTION ArcCos(v : REAL) : REAL;
```

```python

def vs.ArcCos(v):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|v|REAL|Numeric value for which to find the cosine.|

## Version
Availability: from MiniCAD
## Category
* Math - General